In [23]:
import pandas as pd
import numpy as np
data = {'product_name': ['laptop', 'printer', 'tablet', 'desk', 'chair'],
        'price': [1200, 150, 300, 450, 200]
        }

In [10]:

df = pd.DataFrame(data)

print(df)

  product_name  price
0       laptop   1200
1      printer    150
2       tablet    300
3         desk    450
4        chair    200

In [13]:
df.sort_values(by=['price'], ascending=True)

  product_name  price
1      printer    150
4        chair    200
2       tablet    300
3         desk    450
0       laptop   1200

In [21]:
def double(a):
    return 2*a
 
df['price'] = df['price'].apply(double)
 
# Reading Dataframe
df

  product_name  price
0       laptop   2400
1      printer    300
2       tablet    600
3         desk    900
4        chair    400

In [24]:

pd.cut(np.array([2, 7, 5, 4, 6, 8]), 3)

[(1.994, 4.0], (6.0, 8.0], (4.0, 6.0], (1.994, 4.0], (4.0, 6.0], (6.0, 8.0]]
Categories (3, interval[float64]): [(1.994, 4.0] < (4.0, 6.0] < (6.0, 8.0]]

In [26]:
df1 = pd.DataFrame(data={"id": [1, 2], 
                        "values": [[1, 2, 3], [4, 5, 6]]})
df1

   id     values
0   1  [1, 2, 3]
1   2  [4, 5, 6]

In [28]:
df1.explode("values", ignore_index=True)

   id values
0   1      1
1   1      2
2   1      3
3   2      4
4   2      5
5   2      6

In [29]:
print(df.loc[0:4, 'product_name'])
 
# Printing all the rows with price column

print(df.loc[:, 'price'])
 
# Printing only first rows having name.
print(df.iloc[0, 0:2])
 
# Printing first 3 rows having product name and price .
print(df.iloc[0:3, 0:3])
 
# Printing all rows having  product name & price 
print(df.iloc[:, 0:2])

0     laptop
1    printer
2     tablet
3       desk
4      chair
Name: product_name, dtype: object
0    2400
1     300
2     600
3     900
4     400
Name: price, dtype: int64
product_name    laptop
price             2400
Name: 0, dtype: object
  product_name  price
0       laptop   2400
1      printer    300
2       tablet    600
  product_name  price
0       laptop   2400
1      printer    300
2       tablet    600
3         desk    900
4        chair    400